In [2]:
import pandas as pd

orders_df = pd.read_csv("/content/orders (1).csv")
orders_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [3]:
users_df = pd.read_json("users.json")
users_df.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [4]:
import sqlite3

# Create SQLite DB
conn = sqlite3.connect("restaurants.db")
cursor = conn.cursor()

# Read SQL file
with open("restaurants.sql", "r") as file:
    sql_script = file.read()

cursor.executescript(sql_script)

restaurants_df = pd.read_sql("SELECT * FROM restaurants", conn)
conn.close()

restaurants_df.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [5]:
orders_users_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

In [6]:
final_df = pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

In [9]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

print(" Final dataset created: final_food_delivery_dataset.csv")

 Final dataset created: final_food_delivery_dataset.csv

In [10]:
orders_users_df = pd.merge(
    orders_df,
    users_df,
    on="user_id",
    how="left"
)

In [11]:
final_df = pd.merge(
    orders_users_df,
    restaurants_df,
    on="restaurant_id",
    how="left"
)

In [12]:
final_df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [13]:
final_df.to_csv("final_food_delivery_dataset.csv", index=False)

In [14]:
print("Orders rows:", len(orders_df))
print("Final rows:", len(final_df))

Orders rows: 10000
Final rows: 10000

In [21]:
final_df['order_date'] = pd.to_datetime(final_df['order_date'], format='%d-%m-%Y')
final_df.groupby(final_df['order_date'].dt.month)['order_id'].count()

order_date
1     831
2     785
3     903
4     812
5     844
6     784
7     859
8     851
9     812
10    863
11    807
12    849
Name: order_id, dtype: int64

In [18]:
import pandas as pd

df = pd.read_csv("/content/final_food_delivery_dataset.csv")
df.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [22]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .sum() \
  .sort_values(ascending=False) \
  .head(1)

city
Chennai    1080909.79
Name: total_amount, dtype: float64

In [23]:
df.groupby("cuisine")["total_amount"] \
  .mean() \
  .sort_values(ascending=False) \
  .head(1)

cuisine
Mexican    808.021344
Name: total_amount, dtype: float64

In [24]:
user_spend = df.groupby("user_id")["total_amount"].sum()
user_spend[user_spend > 1000].count()

np.int64(2544)

In [28]:
df["rating_range"] = pd.cut(
    df["rating"],
    bins=[3.0, 3.5, 4.0, 4.5, 5.0],
    labels=["3.03.5", "3.64.0", "4.14.5", "4.65.0"]
)

df.groupby("rating_range", observed=False)["total_amount"] \
  .sum() \
  .sort_values(ascending=False) \
  .head(1)

rating_range
4.65.0    2197030.75
Name: total_amount, dtype: float64

In [29]:
df[df["membership"] == "Gold"] \
  .groupby("city")["total_amount"] \
  .mean() \
  .sort_values(ascending=False) \
  .head(1)

city
Chennai    808.45908
Name: total_amount, dtype: float64

In [31]:
df.groupby("cuisine").agg(
    restaurant_count=("restaurant_name_y", "nunique"),
    total_revenue=("total_amount", "sum")
).sort_values(
    ["restaurant_count", "total_revenue"],
    ascending=[True, False]
).head(1)

         restaurant_count  total_revenue
cuisine
Chinese               120     1930504.65

In [33]:
round(
    (df[df["membership"] == "Gold"].shape[0] / df.shape[0]) * 100
)

50

In [36]:
df.groupby("restaurant_name_y").agg(
    avg_order_value=("total_amount", "mean"),
    total_orders=("user_id", "count")
).query("total_orders < 20") \
 .sort_values("avg_order_value", ascending=False) \
 .head(1)

                   avg_order_value  total_orders
restaurant_name_y
Restaurant_294         1040.222308            13

In [38]:
df.groupby(["membership", "cuisine"])["total_amount"] \
  .sum() \
  .sort_values(ascending=False) \
  .head(1)

membership  cuisine
Regular     Mexican    1072943.3
Name: total_amount, dtype: float64

In [39]:
df["order_date"] = pd.to_datetime(df["order_date"])

df["quarter"] = df["order_date"].dt.quarter

df.groupby("quarter")["total_amount"] \
  .sum() \
  .sort_values(ascending=False) \
  .head(1)

/tmp/ipython-input-109480541.py:1: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df["order_date"] = pd.to_datetime(df["order_date"])

quarter
3    2037385.1
Name: total_amount, dtype: float64

In [40]:
monthly_orders = df.groupby(df["order_date"].dt.to_period("M")).size()
monthly_orders

order_date
2023-01    804
2023-02    785
2023-03    903
2023-04    812
2023-05    844
2023-06    784
2023-07    859
2023-08    851
2023-09    812
2023-10    863
2023-11    807
2023-12    849
2024-01     27
Freq: M, dtype: int64

In [41]:
monthly_revenue = df.groupby(df["order_date"].dt.to_period("M"))["total_amount"].sum()
monthly_revenue

order_date
2023-01    645818.76
2023-02    630867.40
2023-03    716738.98
2023-04    666097.18
2023-05    668428.61
2023-06    610822.93
2023-07    688559.45
2023-08    694987.58
2023-09    653838.07
2023-10    699187.73
2023-11    637772.43
2023-12    681303.50
2024-01     17201.50
Freq: M, Name: total_amount, dtype: float64

In [42]:
df.groupby("user_id")["total_amount"].mean().describe()

count    2883.000000
mean      799.247530
std       251.053045
min       102.220000
25%       640.187500
50%       800.686000
75%       961.117083
max      1497.420000
Name: total_amount, dtype: float64

In [43]:
df.groupby("user_id").size().describe()

count    2883.000000
mean        3.468609
std         1.792682
min         1.000000
25%         2.000000
50%         3.000000
75%         4.000000
max        13.000000
dtype: float64

In [44]:
df.groupby("user_id").size().sort_values(ascending=False).head(10)

user_id
2973    13
1515    12
496     11
874     11
1337    11
1201    10
789     10
2640    10
1841    10
650     10
dtype: int64

In [45]:
df.groupby("city")["total_amount"].sum().sort_values(ascending=False)

city
Bangalore    2206946.58
Chennai      1990513.03
Pune         1924797.93
Hyderabad    1889366.58
Name: total_amount, dtype: float64

In [46]:
df.groupby("city")["total_amount"].mean().sort_values(ascending=False)

city
Chennai      806.202118
Hyderabad    803.985779
Bangalore    802.234308
Pune         792.097914
Name: total_amount, dtype: float64

In [47]:
df.groupby("cuisine")["total_amount"].sum().sort_values(ascending=False)

cuisine
Mexican    2085503.09
Italian    2024203.80
Indian     1971412.58
Chinese    1930504.65
Name: total_amount, dtype: float64

In [49]:
df.groupby("membership")["total_amount"].sum()

membership
Gold       3975364.89
Regular    4036259.23
Name: total_amount, dtype: float64

In [51]:
df.groupby("membership")["total_amount"].mean()

membership
Gold       797.145556
Regular    805.158434
Name: total_amount, dtype: float64

In [53]:
df["membership"].value_counts()

membership
Regular    5013
Gold       4987
Name: count, dtype: int64

In [55]:
round(
    df.groupby("membership")["total_amount"].sum()
    / df["total_amount"].sum() * 100, 2
)

membership
Gold       49.62
Regular    50.38
Name: total_amount, dtype: float64

In [56]:
df["total_amount"].describe()

count    10000.000000
mean       801.162412
std        405.458753
min        100.200000
25%        446.310000
50%        806.295000
75%       1149.227500
max       1499.830000
Name: total_amount, dtype: float64

In [57]:
df["quarter"] = df["order_date"].dt.quarter

df.groupby("quarter")["total_amount"].sum().sort_values(ascending=False)

quarter
3    2037385.10
4    2018263.66
1    2010626.64
2    1945348.72
Name: total_amount, dtype: float64

In [58]:
df.groupby(df["order_date"].dt.month)["total_amount"].sum()

order_date
1     663020.26
2     630867.40
3     716738.98
4     666097.18
5     668428.61
6     610822.93
7     688559.45
8     694987.58
9     653838.07
10    699187.73
11    637772.43
12    681303.50
Name: total_amount, dtype: float64

In [60]:
import pandas as pd

df = pd.read_csv("/content/final_food_delivery_dataset.csv")

# Normalize column names to avoid KeyError
df.columns = df.columns.str.strip().str.lower().str.replace(" ", "_")

# Convert date column
df["order_date"] = pd.to_datetime(df["order_date"])

/tmp/ipython-input-4012943654.py:9: UserWarning: Parsing dates in %d-%m-%Y format when dayfirst=False (the default) was specified. Pass `dayfirst=True` or specify a format to silence this warning.
  df["order_date"] = pd.to_datetime(df["order_date"])

In [62]:
df[df["membership"] == "Gold"].shape[0]

4987

In [63]:
round(
    df[df["city"] == "Hyderabad"]["total_amount"].sum()
)

1889367

In [64]:
df["user_id"].nunique()

2883

In [66]:
round(
    df[df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

np.float64(797.15)

In [68]:
round(
    df[df["membership"] == "Gold"]["total_amount"].mean(),
    2
)

np.float64(797.15)

In [70]:
df[df["rating"] >= 4.5].shape[0]

3374